{
  "404": {
    "desc": "La page que tu demandes n'existe pas.",
    "go_home": "Retour",
    "not_found": "Page non trouvée",
    "oops": "Oups !"
  },
  "abort": "Abandonné",
  "about": "À propos",
  "account": {
    "delete": {
      "button": "Supprimer mon compte",
      "error": {
        "aborted": "Opération abandonnée.",
        "wrong_passphrase": "Passphrase incorrecte. Opération abandonnée."
      },
      "popup": {
        "button": {
          "destroy": "Détruire mon compte définitivement",
          "return": "Retour en sécurité"
        },
        "confirm": "Pour supprimer ton compte, confirme ta passphrase :",
        "title": "Es-tu sûr ? ",
        "warn1": "Tu ne seras pas en mesure d'annuler cette action. Tu n'auras plus d'accès à ton coffre TOTP.",
        "warn2": "Tu vas perdre TOUS tes secrets",
        "warn3": "TOUTES les backups sur Google Drive vont être DÉTRUITES"
      },
      "success": "Merci d'avoir utilisé Zero-TOTP. Ton compte a été supprimé. Au revoir 👋",
      "title": "Suppression de compte",
      "warning": "Une fois ton compte supprimé, tu ne pourras pas revenir en arrière. Sois en sûr. "
    },
    "email": {
      "current": "Ton email actuel est",
      "error": "Une erreur est survenue. Merci de réessayer plus yatd",
      "errors": {
        "char": "&, <, >, \" et ' sont interdits",
        "invalid": "Es-tu sûr de ton adresse email ? ",
        "match": "Tes emails ne correspondent pas !"
      },
      "success": "Email mis à jour avec succès",
      "title": "Modification d'email",
      "update": {
        "confirm": "Confirme ton email",
        "label": "Nouvel email"
      }
    },
    "errors": {
      "network": "Impossible de discuter avec le serveur. Vérifie ta connexion internet et status.zero-totp.com",
      "unknown": "Oups, une erreur est survenue. Réponse du serveur : "
    },
    "loading": "Récupération de ta saveur de glace préférée ... ",
    "passphrase": {
      "confirm": "Confirme ta passphrase",
      "current": "Ta passphrase actuelle",
      "error": {
        "char": "' \\\" < et > sont interdits dans les passphrase",
        "decrypt": "Erreur : Impossible de chiffrer ton coffre.",
        "decrypt_one_secret": "Clé invalide. Tu ne peux pas déchiffrer ce secret. Ce secret sera ignoré. Déconnecte et reconnecte toi.",
        "derive": "Erreur : Impossible de dériver ta nouvelle passphrase",
        "expired": "Impossible de déchiffrer ton coffre. Ta clé de déchiffrement a expiré. Déconnecte et reconnecte toi.",
        "fatal": "Une erreur est survenue en mettant à jour ton coffre. Des informations peuvent ne pas avoir été mises à jour. ",
        "fatal_light": "Opération abandonnée. Rien n'a été modifié.",
        "fetch_vault": "Erreur : Impossible de récupérer ton coffre depuis le serveur.",
        "full_abort": "Une erreur est survenue. Aucune modification n'a été faite. La mise à jour a été abandonné. Signale le code d'erreur ",
        "hash_new": "Une erreur est survenue en hachant ta nouvelle passphrase. Ton coffre et ta passphrase n'ont pas été modifiées. Tu peux réessayer.",
        "hashing": "Une erreur est survenue en hachant ta passphrase. Merci de réessayer ",
        "incorrect": "La passphrase est incorrecte.",
        "length": "Ta passphrase doit contenir au moins 12 caractères.",
        "light_abort": "Ta passphrase et ton coffre ont bien été modifiés. Mais une erreur est survenue lors des dernières étapes de finition. Voici l'étape qui a échouée :",
        "match": "Les passphrases ne correspondent pas",
        "network": "Serveur injoignable. Merci de vérifier ta connexion internet ou de réessayer. Ne rafraîchis pas la page pour éviter de perdre ta session.",
        "number": "Ta passphrase doit contenir au moins un chiffre",
        "special": "Ta passphrase doit contenir au moins un caractère spécial",
        "upper": "Ta passphrase toi contenir au moins une majuscule",
        "wrong_key": "Mauvaise clé. Tu ne peux pas déchiffrer ces secrets. Les secrets affichés pourraient ne pas être complets. Déconnecte et reconnecte toi.",
        "wrong_key_vault": "Clé invalide. Tu ne peux pas déchiffrer ce coffre."
      },
      "new": "Ta nouvelle passphrase",
      "no_former_passphrase": "Ta passphrase actuelle est requise pour être modifiée",
      "popup": {
        "google": {
          "backup_error": "Erreur : Impossible de backup ton coffre sur Google Drive.",
          "delete_error": "Une erreur est survenue en supprimant ta backup de Google Drive",
          "fetch_error": "Erreur : Impossible de vérifier des préférences Google Drive.",
          "option": {
            "delete": {
              "info": "(Recommandé si ton ancienne passphrase n'est plus sûre)",
              "strong": "Supprimer mes vieilles backup et créer une nouvelle backup"
            },
            "keep": {
              "strong": "Garder mes vieilles backups avec ma vieille passphrase et faire une nouvelle backup"
            }
          },
          "title": "Oh ! Tu as des backups sur Google Drive"
        },
        "updating": {
          "derivation": "Dérivation de ta nouvelle passphrase",
          "descryption": "Déchiffrement de ton coffre",
          "destroy": "Destruction de tes backup Google Drive",
          "download": "Téléchargement de ton coffre chiffré",
          "encryption": "Chiffrement de ton coffre avec ta nouvelle clé",
          "subititle": "Nous re-chiffrons toutes tes données. Fermer cet onglet pourrait les corrompre définitivement",
          "success": "Ta passphrase a été mise à jour ! Tu peux maintenant te connecter avec ta nouvelle passphrase 🎉",
          "title": "Ne ferme pas cette page",
          "upload": "Envoi de ton coffre chiffré",
          "upload_google": "Envoie d'une nouvelle backup chiffrée vers Google Drive",
          "verif": "Vérification de ta précédente passphrase",
          "verif_new": "Vérification de ton nouveau coffre chiffré"
        },
        "warning": {
          "continue": "Je suis sûr",
          "subtitle": "Modifier ta passphrase va : ",
          "title": "Sois prudent ",
          "warn1": "Re-chiffrer ton coffre ",
          "warn2": "Toutes tes vieilles backups seront toujours chiffrées avec ta précédente passphrase",
          "warn3": "Tes backup Google Drive vont être mises à jour. Si tu as de vieilles backups, elles seront toujours chiffrées avec ton ancienne passphrase. Si cette dernière n'est plus sûre tu devrais les supprimer sans  délais.",
          "warn4": "Si tu perds cette nouvelle passphrase, il n'y a aucuns moyens de la récupérer",
          "warn5": "Si tu change ta passphrase pour des raisons de sécurité, supprime tes backups immédiatement"
        }
      },
      "title": "Modifier ta passphrase"
    },
    "title": "Ton compte ⚙️",
    "username": {
      "current": "Ton nom d'utilisateur actuel est : ",
      "error": {
        "char": "&, <, >, \" et ' sont interdits",
        "missing": "Oups, ça ne peut pas rester vide !",
        "unknown": "Une erreur est survenue en mettant à jour ton nom d'utilisateur. Tu peux réessayer plus tard.  "
      },
      "new": {
        "label": "Nouveau nom d'utilisateur"
      },
      "success": "Nom d'utilisateur mis à jour 🎉",
      "title": "Modifier ton nom d'utilisateur "
    }
  },
  "add": "Ajouter",
  "always": "Toujours",
  "available_soon": "Disponible bientôt !",
  "blue": "Bleu",
  "cancel": "Retour",
  "changelog": "Changelog",
  "close": "Fermer",
  "continue": "Continuer",
  "copied": "Copié !",
  "decrypt": "Déchiffrer",
  "decrypted": "déchiffré",
  "delete": "Supprimer",
  "email": "Email",
  "email_verif": {
    "code": {
      "placeholder": "Entre le code ici"
    },
    "desc1": {
      "link": "demande un nouveau code",
      "text": "Ce code n'est valide que 10 minutes. Si tu ne reçois pas de mail, vérifie ton dossier SPAM ou"
    },
    "desc2": {
      "link": "changer ici",
      "part2": "Si tu veux modifier ton adresse mail, tu peux la",
      "text": {
        "part1": "Un email a été envoyé à"
      }
    },
    "error": {
      "already_verified": "Email déjà vérifié",
      "expired": "Ton code de vérification a expiré. Demande en un nouveau.",
      "failed": "Mauvais code de vérification. Il te reste {{left_attempts}} essai(s) avant d'invalider ton code de vérification.",
      "generic": "Code invalide ou expiré",
      "no_active_code": "Tu n'as pas de code de vérification actif. Pour vérifier ton adresse mail, demande en un nouveau.",
      "no_email": "Pour commencer, connecte toi",
      "rate_limited": "Tu es rate limité ! Tu as demandé trop de codes de vérification en peu de temps. Tu pourras demander de nouveaux codes dans {{time}} min.",
      "too_many_failed": "Trop de tentatives échouées. Demande un nouveau code de vérification.",
      "unknown": "Une erreur est survenue ! Déconnecte et reconnecte toi ❌"
    },
    "popup": {
      "button": {
        "update": "Modifier mon adresse mail"
      },
      "error": "Une erreur est survenue. Tu peux réessayer",
      "success": "Email mis à jour avec succès. Tu devrais recevoir un email de vérification bientôt ! ✅"
    },
    "resend": {
      "error": "Une erreur est survenue ! ❌",
      "success": "Email envoyé ! ✅"
    },
    "subtitle": {
      "part1": "Nous avons envoyé un mail à",
      "part2": "pour vérifier ton adresse email."
    },
    "title": "Vérifie ton adresse email",
    "verify": {
      "already_verified": "Email déjà vérifié !",
      "success": "Email vérifié ! ✅"
    }
  },
  "encrypted": "chiffré",
  "footer": {
    "bug": "Signaler un bug",
    "opensource": "Composants open-source"
  },
  "generic_errors": {
    "bad_email": "Email invalide",
    "email_exists": "Cet email existe déjà",
    "error": "Erreur",
    "invalid_creds": "Identifiants invalides",
    "invalid_request": "Requête invalide",
    "missing_params": "Des paramètres sont manquants",
    "user_not_found": "Utilisateur non trouvé",
    "username_exists": "Nom d'utilisateur déjà existant"
  },
  "give_up": "Abandonner",
  "green": "Vert",
  "home": {
    "about": {
      "title": "À propos de la Zero-Knowledge Encryption",
      "zke_def": "Le chiffrement à connaissance nulle (ZKE) désigne une mesure de sécurité robuste qui garantit une protection maximale de tes données. Avec le ZKE, tes informations sont chiffrées localement sur ton appareil avant d'être envoyées vers nos serveurs, et seul toi détiens les clés de chiffrement, assurant ainsi que personne, y compris le fournisseur de services (nous), ne peut accéder à tes données. Cela te donne un contrôle total sur tes informations sensibles tout en profitant de la commodité et de la flexibilité du stockage dans le cloud."
    },
    "backup": {
      "desc": "On devrait toujours pouvoir accéder à nos codes TOTP. C'est pourquoi",
      "desc_strong": "Zero-TOTP est disponible sur 4 plateformes indépendantes via lesquelles tu peux déchiffrer ton coffre",
      "option": {
        "available": "Déjà disponible !",
        "beta": "Disponible en beta",
        "cli": "Pour récupérer tous tes codes TOTP depuis ton terminal (CLI unix seulement).",
        "mobile": "Pour récupérer tous tes codes TOTP depuis ta .",
        "rescue": "Un site web très simple, minimaliste et ULTRA stable, hébergé sur github pages où tu pourras upload une backup de ton coffre et le déchiffrer. Ainsi, même si les serveurs de Zero-TOTP rencontrent un problème, tu pourras toujours ouvrir les backups de ton coffre.",
        "soon": "Arrive bientôt",
        "zero_totp": "La version complète de Zero-TOTP  avec toutes ses fonctionnalités."
      },
      "title": "Toujours avoir un ",
      "title_strong": "plan de secours"
    },
    "button": {
      "buy_me_a_coffee": "m'offrir un café",
      "github_project": "Suis mon projet sur GitHub",
      "learnMore": "En savoir +",
      "openVault": "Ouvrir mon coffre"
    },
    "buyMeCoffee": {
      "desc": "Les application open source & auto-hébergés sont possible grâce à ton support. Si tu aimes ce projet, tu peux"
    },
    "data": {
      "google": {
        "desc": "Tu peux synchroniser ton coffre chiffré avec Google Drive. Cette option n'est pas obligatoire mais vivement recommandée. Si jamais nos serveurs ont un problèmes, tu pourras quand même récupérer ton coffre chiffré depuis Google Drive.<br>Dans tous les cas, ton coffre est toujours chiffré et seule ta passphrase peut le déchiffrer. Cette passphrase n'est jamais stockée quelque part.",
        "title": "Backup ton coffre chiffré sur Google Drive"
      },
      "local": {
        "desc": "Tu peux télécharger ton coffre chiffré et le stocker sur ton ordinateur (ou n'importe où ailleurs). Cette option n'est pas obligatoire mais vivement recommandée. Si nos serveurs rencontrent un problème, tu pourras récupérer ton coffre chiffrée depuis ton ordinateur.<br>Comme toujours, ton coffre reste chiffré et seule ta passphrase peut le déchiffrer. Cette passphrase n'est jamais stockées quelque part.",
        "title": "Backup ton coffre chiffrée dans ton ordinateur"
      },
      "subtitle": "Choisis où stocker ton coffre chiffré",
      "title": "Ne perds jamais tes données",
      "zero_totp": {
        "desc": "C'est l'option par défaut et obligatoire. Ton coffre chiffré est stocké sur nos servers, hébergés au Canada 🇨🇦, en Suisse 🇨🇭 et en Allemagne 🇩🇪. Personne ne peut accéder à tes données, sauf toi. C'est cette méthode qui est utilisée quand tu te connecte sur <a href='https://zero-totp.com'>zero-totp.com</a>. Tu ne peux pas désactiver cette option, mais tu peux toujours sauvegarder ton coffre chiffré sur ton ordinateur ou sur Google Drive.",
        "title": "Stock ton coffre chiffré sur les serveur de Zero-TOTP"
      }
    },
    "project": {
      "desc": {
        "contributions": "Tous les contributions sont les bienvenues !",
        "part1": "Zero-TOTP a été lancé en 2023 par",
        "part2": "avec l'ambition de fournir une alternative 100% open-source, sûre et fiable aux clients TOTP propriétaires. Ce projet est toujours en développement et est actuellement en beta."
      },
      "title": "Le projet"
    },
    "subtitle": "Zero-TOTP est une plateforme",
    "subtitle.and": "et basée sur une",
    "subtitle.opensource": "100% open-source",
    "subtitle.platform": "",
    "subtitle.zke": "Zero-Knowledge Infrastructure.",
    "title": "Garde tes codes TOTP dans un ",
    "title.strong": "endroit sûr",
    "trust.no.one": "N'ai confiance en personne, sauf en TOI.",
    "tuto": {
      "2FA": "authentification à 2 facteurs",
      "accounts": "pour sécuriser tes comptes (gmail, facebook, twitter, github, etc ...). C'est comme un code de validation SMS, mais plus sécurisé et plus pratique !",
      "title": "Ajoute une couche de sécurité à tes comptes",
      "tmp_codes": "des codes temporaires",
      "totp_are": "Les codes TOTP sont",
      "totp_client": {
        "desc": "À chaque fois que tu te connectes à un de tes comptes, tu devras entrer un nouveau code. Ce code est généré par une application sur ton téléphone ou ton ordinateur. Cette application est un",
        "name": "client TOTP"
      },
      "totp_time": "Un code TOTP est seulement valide ",
      "use_as": "que tu peux utiliser comme"
    },
    "why": {
      "key": {
        "desc1": "Seule ta passphrase peut déchiffrer ton coffre.",
        "desc2": "Tous les chiffrements sont effectués dans ton navigateur, et tes données sont protégées avant même qu'elles aient quitté ton appareil !",
        "title": "Tu détiens les clés"
      },
      "opensource": {
        "desc1": "Zero-TOTP est 100% open-source et 100% gratuit. Ne fais jamais confiance à quiconque, sauf toi.",
        "desc2": "Nous sommes 100% transparents et n'importe qui peut accéder au code source",
        "title": "100% open-source"
      },
      "strong_enc": {
        "l1": "avec AES256, un protocole de chiffrement extrêmement robuste.",
        "l2": "Seul toi peut déchiffrer tes données avec ta passphrase.",
        "strong": "Toutes tes données sont chiffrées",
        "title": "Chiffrement robuste"
      },
      "title": "Pourquoi Zero-TOTP ?",
      "zke": {
        "desc": {
          "1": "Zero-TOTP utilise du chiffrement Zero-Knwoledge ce qui veut dire que ",
          "2": "sauf toi. Même les administrateurs des serveurs n'ont pas accès à tes données. Toi et seulement toi est capable de déchiffrer ton coffre.",
          "strong": "personne ne peut accéder à tes données"
        },
        "title": "Zero-Knowledge Encryption"
      }
    }
  },
  "hour": "heure",
  "import_from": "Importer depuis",
  "import_vault": {
    "merging_method": {
      "merge": {
        "paragraph": "Fusionner le coffre importer avec le coffre actuel. Aucuns codes TOTP ne sera supprimé, le coffre importé sera ajouté à l'actuel.",
        "title": "Fusionner"
      },
      "replace": {
        "paragraph": "Remplacer tous les codes TOTP actuels avec le coffre importé. Tous les codes TOTP actuels seront supprimés et les nouveaux, ajoutés.",
        "title": "Remplacer"
      }
    },
    "steps": {
      "decrypt": "Déchiffre ton coffre",
      "encrypt": "Chiffrer et uploader",
      "import_vault": "Importe ton coffre",
      "select": "Sélectionner la méthode de fusion"
    },
    "title": "Importer un coffre",
    "zero_totp": {
      "decrypt": "Déchiffre ton coffre",
      "encrypt": "Chiffrer le nouveau coffre et l'uploader",
      "import": "Importe une backup de ton coffre Zero-TOTP",
      "select": "Méthode de fusion",
      "will_be_deleted": "Sera supprimé",
      "will_be_kept": "Ajouté"
    }
  },
  "less": "Moins",
  "loading": "Chargement ...",
  "log_in": "Connexion",
  "logging-out": {
    "loading": "Déconnexion ..."
  },
  "login": {
    "authorize": "Autoriser",
    "backup": {
      "open": {
        "popup": {
          "title": "Déverrouille ton coffre"
        }
      },
      "open_button": "Ouvrir une backup",
      "subtitle": "Tu peux ouvrir un coffre Zero-TOTP sauvegardé sur ton ordinateur 💻",
      "unsecure": {
        "popup": {
          "button": {
            "cancel": "Retour en sécurité"
          },
          "continue": "Je fais confiance à cette backup",
          "desc": "Ce coffre peut avoir été modifié par quelque d'autre ou ne provient pas de Zero-TOTP.",
          "strong": "La vérification de l'authenticité du coffre a échouée ",
          "strong2": "Importer un coffre non sécurisé peut mener à des problèmes de sécurités et ne doit pas être considéré comme fiable",
          "title": "Votre backup pourrait ne pas être sécurisée"
        }
      },
      "vault_backup": "Backup de ton coffre"
    },
    "errors": {
      "account_blocked": "Ton compte a été bloqué pour des raisons de sécurités. Contact un administrateur via developer[at]zero-totp.com pour le débloquer.",
      "confirm_passphrase": "Pour continuer, confirm ta passphrase",
      "email": "Es-tu sûr de ton adresse mail ? ",
      "empty": "Tu n'as pas oublié quelque chose ?",
      "general_error": "Une erreur est survenue.",
      "hashing": "Une erreur est survenue en hachant ton mot de passe. Merci de réessayer.",
      "import_vault": {
        "error_unknown": "Erreur : Impossible d'importer ton coffre. Erreur inconnue.",
        "invalid_arg": "Erreur : Impossible d'importer ton coffre. Il semble corrompu.",
        "invalid_file": "Erreur : impossible d'importer ton coffre. Impossible de le lire.",
        "invalid_type": "Type de fichier invalide",
        "invalid_version": "Erreur : impossible d'importer ton coffre. Version non supportée",
        "key_dec": "Impossible de déchiffrer ta clé.",
        "missing_arg": "Erreur : impossible d'importer ton coffre. Il ne semble pas complet.",
        "no_signature": "Erreur : impossible d'importer ton coffre. Aucune signature n'a été trouvée.",
        "parse_fail": "Erreur : impossible d'importer ton coffre. Impossible de parser le fichier",
        "wrong_passphrase": "Mauvaise passphrase"
      },
      "no_connection": "Impossible de discuter avec le server ! Vérifie ta connexion internet et status.zero-totp.com",
      "no_session": "Ta session a expiré. Connecte toi de nouveau pour compléter la synchronisation",
      "oauth": "Une dernière étape, confirme ta passphrase pour compléter la synchronisation",
      "rate_limited": "Tu es rate limité ! Ton adresse IP a généré trop de connexion échoué en peu de temps. Tu pourras essayer de te connecter à nouveau dans {{time}} min. Si tu utilises un VPN, essaye une autre localisation ou désactive le.",
      "server_error": "Erreur : Impossible de récupérer les informations depuis le serveur",
      "session_end": "Pour ta sécurité, chaque session doit être renouvelée toutes les heures",
      "session_killed": "Pour ta sécurité tu as été déconnecté car tu as rafraichi ou fermé l'onglet ",
      "session_timeout": "Pour ta sécurité, tu as été déconnecté car tu étais inactif. Tu peux personnaliser la durée d'inactivité maximum dans tes préférences."
    },
    "open_button": "Ouvrir mon coffre",
    "remember": "Mémoriser mon adresse email",
    "rescue": {
      "part1": "🛟 Des problèmes pour se connecter à ton compte ? Ouvre une backup sur notre ",
      "part2": "Rescue Zero-TOTP",
      "strong": "plateforme ultra stable"
    },
    "subtitle": "Cette fois, c'est toi qui fais la magie 🪄",
    "success": "Coffre déchiffré ✅",
    "title": "Il est temps d'ouvrir ton coffre !"
  },
  "logout": "Déconnexion",
  "more": "Plus",
  "my_vault": "Mon coffre",
  "name": "Nom",
  "navbar": {
    "account": "Compte",
    "add": "Ajouter un code",
    "backup": "Plan de secours",
    "how": "Les TOTP ?",
    "lang": {
      "suggest": "Suggérer d'autres"
    },
    "lose": "Résilience",
    "preferences": "Préférences",
    "vault_backup": "Backup du coffre",
    "why": "Pourquoi Zero-TOTP"
  },
  "never": "Jamais",
  "none": "Aucun",
  "oauth": {
    "error": {
      "impossible": "Erreur : Impossible de backup ton coffre. Réessaye de synchroniser ton compte Google Drive."
    },
    "sync": {
      "loading": "Synchronisation, ne ferme pas cette page ... "
    }
  },
  "orange": "Orange",
  "passphrase": "Passphrase",
  "preference": {
    "account": {
      "security": {
        "autolock": {
          "error": "Minimum {{min}}min, maximum {{max}}h",
          "label": "Temps maximum d'inactivité avant que ton coffre ne s'auto verrouille",
          "success": "Succès ! Cette nouvelle valeur sera appliquée à ta prochaine connexion",
          "title": "Auto-verrouillage du coffre après inactivité"
        },
        "subtitle": "Paramètres liés à la sécurité de ton compte",
        "title": "Paramètres de sécurité de ton compte"
      }
    },
    "advanced": {
      "button": "Afficher les préférences avancées",
      "subtitle": "Paramètres pour gérer plus précisément ton compte Zero-TOTP.",
      "title": "Réglages avancés"
    },
    "backup": {
      "eol": {
        "desc1": "C'est le nombre de jours après lesquels une sauvegarde sera supprimée (uniquement si ton paramètre de sauvegarde minimale est atteint). Ce paramètre est outrepassé par ton paramètre de sauvegarde minimale.",
        "title": "Fin de vie des backups (en jours)"
      },
      "minimum": {
        "desc1": "C'est le nombre minimum de sauvegardes que Zero-TOTP conservera par dessus tout dans ton Google Drive.",
        "desc2": "Ce paramètre outrepasse n'importe quel autre paramètre",
        "title": "Nombre de backup minimal gardé dans Google Drive"
      }
    },
    "error": {
      "fetch": "Une erreur est survenue en récupérant tes préférences",
      "update": "Impossible de mettre à jour tes préférences"
    },
    "iteration": {
      "title": "Nombre d'itérations utilisées par PBKDF2 pour dériver les clés"
    },
    "loading": "Récupération de ton parfum de glace préféré ...",
    "more_info": "Plus d'info",
    "tag": {
      "global": "Paramètre global",
      "sync_only": "Comptes synchronisés seulement"
    },
    "title": "Tes préférences 🔧",
    "vault": {
      "display": {
        "favicon": {
          "info1": "Lorsqu'il est activé, ton navigateur tentera de récupérer la favicon du site que tu ajoutes à ton coffre. En cas d'échec, il affichera une icône par défaut.",
          "info2": "La favicon est récupérée par votre navigateur en utilisant l'API DuckDuckGo (un moteur de recherche respectueux de la vie privée). Zero-TOTP ne transmet aucune information à DuckDuckGo (mise à part l'URL du site) ni au site web cible . L'URI ou le nom de domaine n'est jamais transmis aux serveurs de zero-totp.",
          "info3": "Tu peux désactiver cette fonctionnalité globalement, l'activer globalement, ou utiliser les paramètres individuels pour chaque secret.",
          "option": {
            "enabled": "Si activé seulement"
          },
          "title": "Afficher les favicon des sites web à côté de leur nom"
        },
        "subtitle": "Paramètres généraux sur l'affichage de ton coffre.",
        "title": "Paramètre d'affichage du coffre"
      }
    },
    "warning": {
      "beta": "Zero-TOTP est toujours en beta. Cette valeur sera customisable dans le futur."
    }
  },
  "privacy": {
    "changes": {
      "desc": "Nous pouvons mettre à jours cette Politique de Confidentialité pour refléter nos pratiques ou des requis légaux. Nous vous notifierons de tout changements significatifs par mail ou via notre site web.",
      "title": "Modifications de cette Politique"
    },
    "collect": {
      "li1": {
        "long": "Nous collectons ton adresse mail, ton nom d'utilisateur et la date de création de ton compte afin de créer et gérer ton compte Zero-TOTP.",
        "short": "Information du compte utilisateur: "
      },
      "li2": {
        "long": "Nous utilisons du chiffrement \"Zero-Knowledge\" (Zero-Knowledge Encryption) pour stocker vos codes TOTP en toute sécurité. Nous n'avons aucune connaissance de vos codes TOTP, vos secrets ou les URLs des applications.",
        "short": "Codes TOTP chiffrés: "
      },
      "li3": {
        "long": "Si vous choisissez d'activer les sauvegardes de votre coffre sur Google Drive, nous stockons des identifiants chiffrés afin de permettre l'intégration à Google Drive. Vous pouvez révoquer l'intégration de Google Drive à tout moment. Cela impliquera la suppression de tous les identifiants stockés.",
        "short": "Intégration à Google Drive"
      },
      "li4": {
        "long": "Nous utilisons des cookies d'authentification pour gérer vos sessions de manière sécurisée. Aucun cookie de traçage et aucuns traqueurs ne sont utilisés.",
        "short": "Cookies d'authentification:"
      },
      "li5": {
        "long": "Nous conservons la date et l'heure de votre dernière connexion sur Zero-TOTP. Une fois que vous vous reconnectez, la date précédente est remplacée par la nouvelle. Cette information est utilisée pour mettre en œuvre la politique de conservation des données (voir 4. Conservation des données et contrôle utilisateur).",
        "short": "Dernière date de connexion:"
      },
      "part1": "Nous collectons les informations suivantes: ",
      "title": "Informations que nous collectons"
    },
    "contact": {
      "desc1": "Si vous avez des questions ou des inquiétudes concernant cette Politique de Confidentialité ou vos données, contactez nous à ",
      "title": "Contactez-nous"
    },
    "cookies": {
      "desc": "Nous utilisons uniquement des cookies d'authentification à des fins de gestion de session. Aucuns traqueurs ne sont utilisés.",
      "title": "Cookies"
    },
    "intro": {
      "part1": "Bienvenue sur Zero-TOTP, une application web où les utilisateurs peuvent stocker leurs codes TOTP en toute sécurité pour s'authentifier sur des services tiers via une authentification à 2 facteurs.",
      "part2": "Cette politique de confidentialité vise à définir les principes et les lignes directrices mis en œuvre par Zero-TOTP en ce qui concerne le traitement des données personnelles des utilisateurs du site web zero-totp.com et rescue.zero-totp.com. Le concept de \"données personnelles\" correspond à la définition fournie par l'article 4 du Règlement général sur la protection des données de l'Union européenne (RGPD 2016/679). Il fait référence à toute information capable d'identifier directement ou indirectement une personne physique, telle qu'un nom d'utilisateur, une adresse e-mail, etc. Zero-TOTP affirme son engagement à respecter les lois et réglementations applicables en matière de protection des données et s'engage à préserver leur sécurité, confidentialité et intégrité. Zero-TOTP s'engage formellement à ne pas vendre, louer, échanger ou céder de quelque manière que ce soit des informations personnelles."
    },
    "liability": {
      "desc1": "Bien que nous prenions toutes les mesures raisonnables pour assurer la sécurité et la confidentialité de vos données, nous ne pouvons garantir une protection absolue contre tous les risques potentiels. Nous déclinons toute responsabilité en cas de perte, violation ou accès non autorisé à vos informations. En utilisant Zero-TOTP, vous reconnaissez et acceptez que la sécurité de vos données dépend de facteurs indépendants de notre contrôle.",
      "desc2": "Nous ne fournissons des garanties qu'en ce qui concerne les algorithmes de chiffrement robustes et les mesures de sécurité que nous utilisons pour protéger vos données pendant le stockage et la transmission.",
      "title": "Déclinaison de responsabilité"
    },
    "licence": {
      "desc1": "Zero-TOTP est une application open-source distribuée sous la licence GNU General Publique Licence version 3 (GPL 3). Cela signifie que notre code source est disponible publiquement, et vous pouvez le voir, le modifier et le redistribuer selon les termes de la license GPL 3.",
      "desc2": "En choisissant d'utiliser Zero-TOTP, vous reconnaissez et acceptez de vous conformer aux dispositions de la licence GPL 3. Vous pouvez accéder au code source complet de notre application sur",
      "desc3": "Merci de noter que si le code source est disponible gratuitement et en source ouverte, l'utilisation de Zero-TOTP en tant que service fournis par ce site web est sujet aux termes dictés par cette politique de confidentialité.",
      "title": "Open source et License GPL3"
    },
    "location": {
      "long1": "Pour maximiser la redondance, la réplication et la disponibilité, nous stockons des données dans trois pays : le Canada, l'Allemagne et la Suisse. Cette pratique est conforme au RGPD, car tous ces pays sont reconnus par l'UE comme acceptables pour le transfert de données. De plus, nous respectons les lois suisses sur la protection de la vie privée et la Loi 25 du Québec sur la protection des données.",
      "long2": "Veuillez noter que la liste des pays où les données sont stockées peut changer à l'avenir. Si nous ajoutons un nouveau pays qui n'est pas membre de l'UE, le Canada, les États-Unis ou la Suisse, nous informerons les utilisateurs en conséquence.",
      "title": "Lieu de stockage des données"
    },
    "portability": {
      "long": "Recevoir vos données structurés et lisible par une machine.",
      "short": "Portabilité des données: "
    },
    "retention": {
      "correction": {
        "long": "Vous pouvez rectifier votre nom d'utilisateur, votre email, votre passphrase et vos codes (et ses données associées) dans votre compte. Pour tout autre rectification, vous pouvez contacter developer[at]zero-totp.com",
        "short": "Correction des données:"
      },
      "long1": "Nous conservons toutes vos données, y compris celles de votre coffre, pendant un maximum de cinq ans après votre dernière connexion afin de respecter la limitation du stockage des données en conformité avec le RGPD. Vous pouvez demander la suppression de votre compte et de toutes les données associées via les paramètres de votre compte à tout moment. Vous êtes responsable de la suppression de toutes les sauvegardes chiffrées de votre coffre-fort que vous avez téléchargées et qui ont été stockées sur Google Drive.",
      "long2": "Les exigences en matière de récupération après sinistre et de disponibilité des données impliquent que nous avons un intérêt légitime à maintenir des sauvegardes sécurisées et immuables. Les sauvegardes sont conservées pendant un maximum de 60 jours. Les demandes de suppression laisseront ces sauvegardes intactes, et nous ne supprimerons des données des sauvegardes que si nous y sommes légalement contraints.",
      "short": "Rétention des données:",
      "title": "Rétention des données et contrôle de l'utilisateur"
    },
    "rights": {
      "access": {
        "short": "Accès:"
      },
      "desc": "Vous disposez des droits suivants:",
      "desc2": "Merci de nous contacter par mail à developer[at]zero-totp.com pour exercer ces droits.",
      "erasure": {
        "long": "Demander la suppression des données de votre compte.",
        "short": "Suppression: "
      },
      "long": "Obtenir l'accès à vos informations personnelles. ",
      "objection": {
        "long": "S'opposer à la collecte de vos données dans un but spécific.",
        "short": "Objection:"
      },
      "rectification": {
        "long": "Demander la correction d'une imprécision ou de données incomplètes.",
        "short": "Rectification:"
      },
      "title": "Vos droits"
    },
    "security": {
      "desc": "Nous employons des mesures de sécurités respectant les standards de sécurités pour protéger vos données. Les passphrase sont hachés en utilisant l'algorithme BCRYPT et la dérivation des clés utilise l'algorithme PBKDF2 avec 700 000 itérations. Les données sont chiffrées à l'aide d'un chiffrement AES et une clé de 256 bits.",
      "title": "Sécurité"
    },
    "subtitle": {
      "intro": "Préambule "
    },
    "thirdpart": {
      "part2": "Si l'utilisateur active l'aperçu de favicon, votre navigateur utilisera l'API DuckDuckGo pour récupérer le favicon du site web. Veuillez consulter les politiques de confidentialité de DuckDuckGo, car nous n'avons aucun contrôle sur leurs pratiques de traitement des données. Zero-TOTP ne stocke aucune donnée liée à l'aperçu du favicon, et l'API DuckDuckGo est uniquement utilisée pour récupérer le favicon du site web. Les seules données envoyées à DuckDuckGo sont l'URL du site web par votre navigateur. Zero-TOTP n'accède pas à ces données et ne les stocke que de manière chiffrée."
    },
    "thirdparty": {
      "part1": "Si l'utilisateur active l'intégration avec Google Drive, nous pouvons intégrer des services tiers pour la commodité de l'utilisateur, tels que Google Drive. Veuillez consulter les politiques de confidentialité de ces services, car nous n'avons aucun contrôle sur leurs pratiques de traitement des données.",
      "titles": "Services tiers"
    },
    "title": "Politique de confidentialité de Zero-TOTP",
    "update": "Dernière mise-à-jour ",
    "usage": {
      "auth": {
        "long": "Pour vérifier votre identité et sécuriser votre compte.",
        "short": "Authentification de l'utilisateur: "
      },
      "enc": {
        "long": "Pour stocker vos codes TOTP en toute sécurité sans avoir la connaissance de vos codes, secrets ou des URLs de vos applications",
        "short": "Stockage chiffré:"
      },
      "google": {
        "short": "Backup sur Google Drive: "
      },
      "hoohle": {
        "long": "Si activé, pour permettre les backup de vos données chiffrées sur Google Drive."
      },
      "part1": "Nous utilisons vos informations pour les finalités suivantes:",
      "support": {
        "long": "Pour répondre à vos demandes et vos requêtes envoyées à ",
        "short": "Support utilisateur:"
      },
      "title": "Utilisation de vos informations"
    }
  },
  "privacy_policy": "Politique de confidentialité",
  "qrcode": {
    "add": {
      "manually": "Ajouter le secret TOTP manuellement"
    },
    "back": "Retour",
    "configure": {
      "manually": "Configurer manuellement"
    },
    "device": {
      "no_selected": "Aucun appareil selectionné"
    },
    "error": {
      "pattern_invalid": "Ce n'est pas un QRCode TOTP ou il contient une erreur.",
      "read_error": "Une erreur est survenue en lisant les informations du QRCode"
    },
    "permission": {
      "bigdeal": "Ce n'est pas grave ! Copie simplement le secret depuis l'application tierce et entre le manuellement",
      "no_camera": "Impossible de détecter une caméra",
      "not_possible": "Impossible ?",
      "part1": "Assure toi d'avoir donné la permission au navigateur d'utiliser ta caméra",
      "part2": "Tu dois donner la permission d'utiliser la caméra pour pouvoir scanner le QRCode",
      "part3": "Une caméra est requise pour scanner un QRCode",
      "refused": "Tu as refusé l'accès à Zero-TOTP à ta caméra",
      "strong": "Un soucis ?"
    },
    "starting": "Le scanner de QRCode démarre ...",
    "title": "Scanne le QRCode de l'application dont tu souhaites activer le 2FA TOTP"
  },
  "red": "Rouge",
  "save": "Sauvegarder",
  "seconds": "secondes",
  "session_expired": "Oups, ta session a expirée !",
  "sign_up": "Inscription",
  "signup": {
    "beta": {
      "warning": {
        "desc": "Merci de nous avoir rejoint ! Nous sommes une petite équipe et nous travaillons dur pour faire de Zero-TOTP le meilleur client TOTP. Nous sommes encore en version bêta, donc certaines fonctionnalités ne sont pas encore implémentées, des bugs peuvent survenir et nous avons besoin de votre aide pour améliorer Zero-TOTP. Veuillez signaler tout problème que vous rencontrez. Merci pour votre compréhension et votre aide !",
        "title": "Bienvenue sur la version beta de Zero-TOTP 👋"
      }
    },
    "button": {
      "create": "Créer mon coffre",
      "start": "C'est parti !"
    },
    "checkbox": {
      "beta": "Je comprends qu'il s'agit d'une version beta et j'en accepte les risques. Je comprends que toutes les fonctionnalités ne sont pas encore implémentées et que des bugs peuvent apparaître. Je m'engage à signaler tout problème que je pourrais trouver.",
      "privacy_policy": "J'ai lu et j'accepte la"
    },
    "email": {
      "error": {
        "forbidden": "Les caractères ' \" < > sont interdits dans des emails",
        "invalid": "Ton email n'est pas valide"
      }
    },
    "errors": {
      "beta": "N'oublie pas d'accepter les conditions de la Beta !",
      "hashing": "Une erreur est survenue en hachant ta passphrase. Réessaye plus tard",
      "missing_fields": "Tu n'as pas oublié quelque chose ?",
      "terms": "N'oublie pas d'accepter les termes et conditions !",
      "unknown": "Quelque chose s'est mal passé. Réessaye plus tard"
    },
    "passphrase": {
      "confirmation": "Confirme ta passphrase",
      "error": {
        "char": "Ta passphrase doit contenir au moins 12 caractères",
        "match": "Tes passphrases ne correspondent pas",
        "number": "Ta passphrase doit contenir au moins un chiffre",
        "special_char": "Ta passphrase doit contenir au moins un caractère spécial",
        "upper": "Ta passphrase doit contenir au moins une majuscule"
      }
    },
    "popup": {
      "instruction": "Pour créer ton coffre, recopie la phrase suivante",
      "phrase": "Ma passphrase est forte et je ne l'oublierai pas",
      "subititle": {
        "part2": "Toi et seulement toi peut ouvrir ton coffre."
      },
      "subtitle": {
        "part1": "Zero-TOTP utilise du chiffrement dit \"Zero-Knowledge\" ce qui veut dire qu'il sera",
        "strong": "impossible de récupérer ta passphrase si tu la perds !"
      },
      "title": "Es-tu sûr ?"
    },
    "subtitle": "Un voyage sûr et fiable",
    "success": "Compte créé avec succès 🎉🎉",
    "username": {
      "error": {
        "forbidden": "Les caractères ' \" < > sont interdits dans des noms d'utilisateur"
      }
    },
    "welcome": "Bienvenue à bord de Zero-TOTP beta "
  },
  "start": "Commencer",
  "stop": "Arrêter",
  "totp": {
    "delete": {
      "popup": {
        "corps": "Il ne sera pas possible d'annuler cette action",
        "destroy": "Détruire ce secret",
        "title": "Es-tu sûr ?"
      }
    },
    "error": {
      "char": "<, >, \\\" et ' sont interdits",
      "code": "Secret invalide. ",
      "decryption": "Une erreur est survenue en déchiffrant ton secret",
      "deleting": "Une erreur est survenue en supprimant ton secret.",
      "encryption": "Une erreur est survenue en chiffrant ton secret",
      "fav_empty": "L'URI ne peut pas être vide",
      "fetch_secret": "Une erreur est survenue en récupérant le secret",
      "fetch_secret_server": "Une erreur est survenue en récupérant le secret depuis le serveur",
      "invalid_domain": "Nom de domaine invalide",
      "invalid_uri": "URI invalide",
      "missing_https": "http(s):// manquant",
      "name_empty": "Le nom ne peut pas être vide",
      "no_fav": "Aucune favicon trouvée pour ce domaine",
      "preferences": "Une erreur est survenue en récupérant tes préférences",
      "ro": "Tu en mode lecture-seulement. Tu ne peux rien modifier sur un coffre local.",
      "secret_empty": "Un secret ne peut pas être vide",
      "tag_empty": "Le tag ne peut pas être vide",
      "tag_exists": "Ce tag existe déjà",
      "tag_length": "Nom de tag trop long",
      "update": "Une erreur est survenue en ajoutant un nouveau code à ton coffre.",
      "update_pref": "Impossible de mettre à jour tes préférences."
    },
    "favicon": {
      "add": {
        "desc": {
          "part2": "Tu peux configurer cette politique globale dans tes préférences. La politique globale remplace ce paramètre.",
          "strong": "Le nom de domaine ou l'URI n'est jamais transmis aux serveurs de Zero-TOTP. Votre navigateur utilise l'API DuckDuckGo pour récupérer le favicon. Aucune autre information que l'URI n'est transmise par Zero-TOTP à DuckDuckGo ou au site web cible."
        },
        "label": "Ajouter le logo favicon du site web."
      },
      "label": "Afficher la favicon",
      "policy": {
        "always": "Politique globale : Toujours",
        "never": "Politique globale : Jamais"
      }
    },
    "secret": {
      "add": {
        "added": "Nouveau code TOTP ajouté !",
        "label": "Secret TOTP",
        "success": "Code TOTP mis à jour !"
      },
      "delete": {
        "success": "Code TOTP supprimé !"
      }
    },
    "tag": {
      "popup": {
        "placeholder": "Nom du tag",
        "title": "Ajouter un tag"
      }
    }
  },
  "unlock": "Déverrouiller",
  "update": "Mettre à jour",
  "username": "Nom d'utilisateur",
  "vault": {
    "add": {
      "manual": "L'entrer manuellement",
      "scan": "Scanner un QRCode",
      "title": "Choisis un méthode pour ajouter un nouveau code TOTP"
    },
    "button": {
      "add": "Ajouter un nouveau code TOTP",
      "reload": "Rafraichir mon coffre"
    },
    "downloaded": "Coffre chiffré téléchargé ! 🧳\\n Garde le en endroit sûr 🔒",
    "error": {
      "backup": {
        "part1": "Erreur : Impossible de backup ce coffre.",
        "part2": "Essaye de re-synchroniser ton compte google."
      },
      "decryption": "Une erreur est survenue en déchiffrant les secrets.",
      "decryption_vault": "Impossible de déchiffrer ton coffre. Déconnecte puis reconnecte toi.",
      "google": {
        "disable": "Erreur : Impossible de désactiver Google Drive",
        "unreadable": "Erreur : La backup de ton coffre est illisible. Essaye de backup ton coffre tu Google Drive, à nouveau.",
        "verify": "Impossible de vérifier les backup de ton coffre."
      },
      "preferences": "Une erreur est survenue en récupérant tes préférences",
      "retrieve_vault": "Impossible de récupérer ton coffre depuis le serveur",
      "server": "Impossible de récupérer ton coffre depuis le serveur",
      "server_unreachable": "Serveur injoignable. Merci de verifier ta connexion internet ou de réessayer. Ne rafraichis pas cette page pour éviter de perdre ta session actuelle.",
      "wrong_key": "Clé invalide. Tu ne peux pas déchiffrer ces secrets. Les secrets affichés peuvent ne pas être complets. Déconnecte plus connecte toi à nouveau",
      "wrong_key_vault": "Clé incorrecte. Tu ne peux pas déchiffrer ce coffre."
    },
    "filter": {
      "tag": {
        "title": "Filtrer par tag"
      }
    },
    "google": {
      "disabled": "Google Drive désactivé ! ✅"
    },
    "local": {
      "desc": {
        "code": "Restorer une backup",
        "part1": "Ce coffre est stocké localement sur ton ordinateur. Tu ne peux pas le synchroniser avec d'autres appareils ni avec les serveurs de Zero-TOTP. Tu n'as plus besoin d'une connexion interne pour l'ouvrir.",
        "part2": "Pour restaurer cette backup et le synchroniser avec tous tes appareils, connecte toi et choisis",
        "part3": "dans les options de stockage"
      }
    },
    "oauth": {
      "error": {
        "server": "Impossible de lancer le flow Oauth"
      }
    },
    "storage": {
      "google": {
        "about": {
          "desc1": "Une backup est effectuée à chaque fois qu'une modification est faite à ton coffre.",
          "desc2": "Tu peux modifier la politique de backup dans les préférences."
        },
        "error": {
          "check": "Une erreur est survenue pendant la vérification de tes backups"
        },
        "info": "Plus d'info",
        "last_backup": "Dernière modification sauvegardée :",
        "resync": "Essayer de re-synchroniser",
        "stop_sync": "Arrêter la synchronisation",
        "sync": "Synchroniser"
      },
      "local": {
        "open": "Ouvrir un coffre local",
        "open_ro": "Ouvrir une backup local (lecture seulement)",
        "restore": "Restaurer une backup",
        "save": "Télécharger une backup",
        "title": "Backup locale"
      },
      "title": "Tes options de stockage",
      "zero_totp": {
        "location": "Serveurs Zero-TOTP au Canada 🇨🇦, en Suisse 🇨🇭 et en Europe 🇪🇺",
        "reload": "Rafraîchir le coffre",
        "title": "Serveur Zero-TOTP"
      }
    },
    "subtitle": "Toi et seulement toi peut accéder à ces données. Toute la magie est faite par ton ordinateur.",
    "title": {
      "backup": "Backup du",
      "main": "Et voilà ton coffre TOTP"
    }
  },
  "verify": "Vérifier"
}